## Terraform Checks
#### Format Check 📏`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cloudflare-zerotrust.random_password.dovpc_tunnel_secret: Refreshing state... [id=none]
module.cloudflare-zerotrust.random_password.tunnel_secret: Refreshing state... [id=none]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.warp: Refreshing state... [id=023b1934-a799-4b40-b7b8-7510f5527b58]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.otp: Refreshing state... [id=89cdb541-1b94-4fd6-a544-87753f3fa6d2]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.disk_encryption_macos: Refreshing state... [id=63e08031-4127-43b2-9ff8-3c25c271901b]
module.cloudflare-zerotrust.cloudflare_device_settings_policy.morrislan_settings: Refreshing state... [id=050d34664e05a4829fd68f1f884921be]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_android: Refreshing state... [id=b563f792-b506-4de6-942f-10014a232a7f]
module.cloudflare-zerotrust.cloudflare_teams_rule.block_threats: Refreshing state... [id=a4115fc2-f6ed-4bb6-9bc1-e764cb03badb]
module.cloudflare-zerotrust.cloudflare_device_dex_test.status: Refreshing state... [id=2da89306-832a-4774-b86f-c856a3e0910a]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.github: Refreshing state... [id=3054c1ad-9a73-4638-8ebf-1782304d9f76]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.gateway: Refreshing state... [id=20a2ba2e-1f2d-4d6b-94da-e810d845108a]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_ios: Refreshing state... [id=a07800e8-c0fa-4e25-a6f2-a31babbf773e]
module.cloudflare-zerotrust.cloudflare_teams_location.home: Refreshing state... [id=2b6bb98f19d84a7597c07bc9e42942be]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_windows: Refreshing state... [id=82189582-a53b-47a6-bd21-4dc9b375bd8a]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.firewall_windows: Refreshing state... [id=e1def9b7-52b5-47c2-9b11-71e02e2c8625]
module.cloudflare-zerotrust.cloudflare_teams_rule.allow_morrislan: Refreshing state... [id=1bf69c43-4ef4-4247-80bf-233985d2f0d9]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_macos: Refreshing state... [id=b99d8690-693f-4a7d-bedf-08f2a270b2e0]
module.cloudflare-zerotrust.cloudflare_device_dex_test.ha: Refreshing state... [id=19d7952d-1f81-42f4-8876-1283e2b4032b]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.disk_encryption_windows: Refreshing state... [id=dd3e9a96-2428-462c-a08f-5ef02772bfa5]
module.cloudflare-zerotrust.cloudflare_device_dex_test.unifi: Refreshing state... [id=767925bd-58ff-46e0-876f-7ffa417125c5]
module.cloudflare-zerotrust.cloudflare_device_posture_rule.firewall_macos: Refreshing state... [id=adf5c0d9-521c-4ea6-9ec0-0ee4fcb40571]
cloudflare_record.github_verify: Refreshing state... [id=d558bcc9b8770c150abf3935ad154aa7]
module.static_site.digitalocean_app.site_app: Refreshing state... [id=1a016867-e984-4f55-a67e-687b0dc3f650]
module.cloudflare-zerotrust.cloudflare_tunnel.dovpc: Refreshing state... [id=346faf3a-c0dc-4b86-af59-0d0b0fc0a9c3]
module.cloudflare-zerotrust.cloudflare_tunnel.clancy: Refreshing state... [id=e22b33cc-010f-43d2-9261-73e99b46758c]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_application.application: Refreshing state... [id=eff7a6ba-948e-4d6a-b790-76c2fb75f5ea]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_application.application: Refreshing state... [id=a48f1cd6-cf38-4e15-99de-a9711e6f1fc2]
module.cloudflare-zerotrust.module.access_app_teleport.cloudflare_access_application.application: Refreshing state... [id=841c3752-517b-4601-9a3d-fa907fa06fc3]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_application.application: Refreshing state... [id=9940e328-2cad-4249-b8cd-da9fac6c46ef]
module.static_site.digitalocean_project.site_project[0]: Refreshing state... [id=27ecab9a-b47f-4e38-a3bf-7f43c886e3a3]
module.static_site.cloudflare_record.root_record[0]: Refreshing state... [id=871856b74ac18eb9f7f69c212a9129e4]
module.static_site.cloudflare_record.www_record[0]: Refreshing state... [id=4fc272899d878ba304f9166d4e9a5ac8]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_macos_unifi: Refreshing state... [id=f419cc6e-7e98-4724-b3b0-ab2cf1e3d14b]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_windows_unifi: Refreshing state... [id=82117874-a6d2-40bc-9d88-21f249417062]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_policy.github_policy[0]: Refreshing state... [id=a660da7a-dd31-4d4f-b272-4a175167d3da]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_windows_teleport: Refreshing state... [id=378474b0-8ad8-496b-a730-e821f7c9b40a]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_macos_teleport: Refreshing state... [id=ef6e75cf-6ab8-4f51-8161-19529e760d29]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_ios_ha: Refreshing state... [id=59870379-0998-4551-8cc4-0a50a87687f8]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_macos_ha: Refreshing state... [id=612224ec-f421-4ac8-a9ea-36625db610a9]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_android_ha: Refreshing state... [id=1a0cc2a6-1b99-40d7-8c7e-6b4830cd0fca]
module.cloudflare-zerotrust.cloudflare_access_policy.device_policy_windows_ha: Refreshing state... [id=2598550f-2388-4cba-8a76-c3a49ce5ac2a]
module.cloudflare-zerotrust.cloudflare_record.access_app_teleport: Refreshing state... [id=6b0dd4a8cb1e4c60e6172c4736ce5aa5]
module.cloudflare-zerotrust.cloudflare_tunnel_config.dovpc: Refreshing state... [id=346faf3a-c0dc-4b86-af59-0d0b0fc0a9c3]
module.cloudflare-zerotrust.cloudflare_record.access_app_unifi: Refreshing state... [id=92012367af159ab0ad79d3762cdac9bf]
module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy: Refreshing state... [id=e22b33cc-010f-43d2-9261-73e99b46758c]
module.cloudflare-zerotrust.cloudflare_record.access_app_ha: Refreshing state... [id=4316741f5653368d172de3d009f3b712]
module.cloudflare-zerotrust.cloudflare_record.access_app_status: Refreshing state... [id=a6d3393cfd891159652e32afe7ef8188]
module.teleport.digitalocean_droplet.access: Refreshing state... [id=392123894]
module.teleport.digitalocean_firewall.access: Refreshing state... [id=e957512f-0c74-4cd3-882f-a997b30389c6]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.static_site.digitalocean_app.site_app has changed
  ~ resource "digitalocean_app" "site_app" {
      ~ active_deployment_id = "d2051528-cffe-43ad-907f-4591085e4bf0" -> "a291a2e8-cfe2-4813-8958-7408d0671ef8"
        id                   = "1a016867-e984-4f55-a67e-687b0dc3f650"
      ~ updated_at           = "2023-12-24 20:56:53 +0000 UTC" -> "2023-12-24 20:57:17 +0000 UTC"
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.teleport.digitalocean_droplet.access has been deleted
  - resource "digitalocean_droplet" "access" {
      - id                   = "392123894" -> null
        name                 = "access.morrislan.net"
        # (23 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy will be updated in-place
  ~ resource "cloudflare_tunnel_config" "clancy" {
        id         = "e22b33cc-010f-43d2-9261-73e99b46758c"
        # (2 unchanged attributes hidden)

      ~ config {
          + warp_routing {
              + enabled = true
            }

            # (4 unchanged blocks hidden)
        }
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_config.dovpc will be updated in-place
  ~ resource "cloudflare_tunnel_config" "dovpc" {
        id         = "346faf3a-c0dc-4b86-af59-0d0b0fc0a9c3"
        # (2 unchanged attributes hidden)

      ~ config {
          + warp_routing {
              + enabled = true
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.teleport.digitalocean_droplet.access will be created
  + resource "digitalocean_droplet" "access" {
      + backups              = true
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-22-04-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "access.morrislan.net"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "lon1"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + status               = (known after apply)
      + urn                  = (known after apply)
      + user_data            = (sensitive value)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # module.teleport.digitalocean_firewall.access will be updated in-place
  ~ resource "digitalocean_firewall" "access" {
      ~ droplet_ids     = [] -> (known after apply)
        id              = "e957512f-0c74-4cd3-882f-a997b30389c6"
        name            = "cfzt-ingress"
        tags            = []
        # (3 unchanged attributes hidden)

      - inbound_rule {
          - port_range                = "22" -> null
          - protocol                  = "tcp" -> null
          - source_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - source_droplet_ids        = [] -> null
          - source_kubernetes_ids     = [] -> null
          - source_load_balancer_uids = [] -> null
          - source_tags               = [] -> null
        }

      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "all" -> null
          - protocol                       = "tcp" -> null
        }
      - outbound_rule {
          - destination_addresses          = [
              - "0.0.0.0/0",
              - "::/0",
            ] -> null
          - destination_droplet_ids        = [] -> null
          - destination_kubernetes_ids     = [] -> null
          - destination_load_balancer_uids = [] -> null
          - destination_tags               = [] -> null
          - port_range                     = "all" -> null
          - protocol                       = "udp" -> null
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "1-65535"
          + protocol                       = "udp"
        }
    }

Plan: 1 to add, 3 to change, 0 to destroy.

```

</details>
